{
  "data": {
    "nav": {
      "menu": {
        "open": "close",
        "close": "menu"
      },
      "home": {
        "name": "home"
      },
      "about": {
        "name": "about"
      },
      "work": {
        "name": "work"
      },
      "contact": {
        "name": "contact"
      }
    },
    "about": {
      "intro": "about me",
      "text": "After years of naively designing layouts on the web, I can actually build them now. As a junior front-end developer and audiovisual artist, I'm particularly fascinated by the technological field, innovative methods of art, music, design and new media.",
      "skills": {
        "text": "my technical skills",
        "textToggle": "click to toggle",
        "textInformative": "click on each skill to open its informative wikipedia definition",
        "goBack": "go back",
        "option": [
          {
            "id": 1,
            "skill": "CSS (SCSS)",
            "category": "css",
            "description": "CSS3 consists of a series of selectors and pseudo-selectors that group rules that apply to them. Sass (in the larger context of both syntaxes) extends CSS by providing several mechanisms available in more traditional programming languages, particularly object-oriented languages, but that are not available to CSS3 itself. When SassScript is interpreted, it creates blocks of CSS rules for various selectors as defined by the Sass file. The Sass interpreter translates SassScript into CSS. Alternatively, Sass can monitor the .sass or .scss file and translate it to an output .css file whenever the .sass or .scss file is saved.[3]"
          },
          {
            "id": 2,
            "skill": "html",
            "category": "html",
            "description": "The HyperText Markup Language or HTML is the standard markup language for documents designed to be displayed in a web browser. It defines the meaning and structure of web content. It is often assisted by technologies such as Cascading Style Sheets (CSS) and scripting languages such as JavaScript. Web browsers receive HTML documents from a web server or from local storage and render the documents into multimedia web pages. HTML describes the structure of a web page semantically and originally included cues for its appearance."
          },
          {
            "id": 3,
            "skill": "javascript",
            "category": "javascript",
            "description": "JavaScript (/ˈdʒɑːvəskrɪpt/), often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2023, 98.7% of websites use JavaScript on the client side for webpage behavior,[10] often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices. JavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard.[11] It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM)."
          },
          {
            "id": 4,
            "skill": "git",
            "category": "git",
            "description": "Git (/ɡɪt/)[8] is a distributed version control system[9] that tracks changes in any set of computer files, usually used for coordinating work among programmers who are collaboratively developing source code during software development. Its goals include speed, data integrity, and support for distributed, non-linear workflows (thousands of parallel branches running on different computers).[10][11][12]"
          },
          {
            "id": 5,
            "skill": "VUE.JS",
            "category": "vue",
            "description": "Vue.js features an incrementally adaptable architecture that focuses on declarative rendering and component composition. The core library is focused on the view layer only.[4] Advanced features required for complex applications such as routing, state management and build tooling are offered via officially maintained supporting libraries and packages.[12] Vue.js allows for extending HTML with HTML attributes called directives.[13] The directives offer functionality to HTML applications, and come as either built-in or user defined directives."
          },
          {
            "id": 6,
            "skill": "NUXT.JS",
            "category": "nuxt",
            "description": "The framework is advertised as a 'Meta-framework for universal applications'. The term universal is used here with the meaning that the goal of the framework is to enable users to create web views in JavaScript utilizing the Vue.js single file component system and that can function both as in-browser single page application (SPA) views as well as server-rendered web views which are then (after server rendering) 'rehydrated' to full SPA functionality.[5][6] Additionally, the framework enables users to have the content, or parts of it, fully pre-rendered on the server and served in the manner of static site generators."
          },
          {
            "id": 7,
            "skill": "blade php",
            "category": "blade",
            "description": "Blade templating engine combines one or more templates with a data model to produce resulting views, doing that by transpiling the templates into cached PHP code for improved performance. Blade also provides a set of its own control structures such as conditional statements and loops, which are internally mapped to their PHP counterparts. Furthermore, Laravel services may be called from Blade templates, and the templating engine itself can be extended with custom directives.[30][31]"
          },
          {
            "id": 8,
            "skill": "jquery",
            "category": "jquery",
            "description": "jQuery is a JavaScript library designed to simplify HTML DOM tree traversal and manipulation, as well as event handling, CSS animations, and Ajax.[3] It is free, open-source software using the permissive MIT License.[4] As of August 2022, jQuery is used by 77% of the 10 million most popular websites.[5] Web analysis indicates that it is the most widely deployed JavaScript library by a large margin, having at least 3 to 4 times more usage than any other JavaScript library.[5][6]"
          },
          {
            "id": 9,
            "skill": "bootstrap",
            "category": "bootstrap",
            "description": "Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development. It contains HTML, CSS and (optionally) JavaScript-based design templates for typography, forms, buttons, navigation, and other interface components."
          },
          {
            "id": 10,
            "skill": "gulp.js",
            "category": "gulp",
            "description": "gulp is an open-source JavaScript toolkit, used as a streaming build system (similar to a more package-focused Make) in front-end web development. It is a task runner built on Node.js and npm, used for automation of time-consuming and repetitive tasks involved in web development like minification, concatenation, cache busting, unit testing, linting, optimization, etc.[6] gulp uses a code-over-configuration approach to define its tasks and relies on its small, single-purpose plugins to carry them out. The gulp ecosystem includes more than 3500 such plugins.[7]"
          },
          {
            "id": 11,
            "skill": "json",
            "category": "json",
            "description": "JSON (JavaScript Object Notation, pronounced /ˈdʒeɪsən/; also /ˈdʒeɪˌsɒn/) is an open standard file format and data interchange format that uses human-readable text to store and transmit data objects consisting of attribute–value pairs and arrays (or other serializable values). It is a common data format with diverse uses in electronic data interchange, including that of web applications with servers."
          },
          {
            "id": 12,
            "skill": "command-line interface",
            "category": "command-line interface",
            "description": "A command-line interface (CLI) is a means of interacting with a computer program by inputting lines of text called command-lines. Command-line interfaces emerged in the mid-1960s, on computer terminals, as a user-friendly alternative to punched cards. Today, most users rely on graphical user interfaces ('GUIs') instead of CLIs. However, many programs and operating system utilities lack GUIs, and are intended to be used through CLIs."
          },
          {
            "id": 13,
            "skill": "package manager",
            "category": "package manager",
            "description": "A package manager deals with packages, distributions of software and data in archive files. Packages contain metadata, such as the software's name, description of its purpose, version number, vendor, checksum (preferably a cryptographic hash function), and a list of dependencies necessary for the software to run properly. Upon installation, metadata is stored in a local package database. Package managers typically maintain a database of software dependencies and version information to prevent software mismatches and missing prerequisites. They work closely with software repositories, binary repository managers, and app stores."
          },
          {
            "id": 14,
            "skill": "responsive web design",
            "category": "responsive",
            "description": "Responsive web design (RWD) or responsive design is an approach to web design that aims to make web pages render well on a variety of devices and window or screen sizes from minimum to maximum display size to ensure usability and satisfaction.[1][2] A responsive design adapts the web-page layout to the viewing environment[1] by using techniques such as fluid proportion-based grids,[3][4] flexible images,[5][6] and CSS3 media queries,[7][8][9] an extension of the @media rule"
          },
          {
            "id": 15,
            "skill": "figma",
            "category": "figma",
            "description": "Figma is a collaborative web application for interface design, with additional offline features enabled by desktop applications for macOS and Windows. The feature set of Figma focuses on user interface and user experience design, with an emphasis on real-time collaboration,[1] utilising a variety of vector graphics editor and prototyping tools. The Figma mobile app for Android and iOS allows viewing and interacting with Figma prototypes in real-time on mobile and tablet devices."
          },
          {
            "id": 16,
            "skill": "photoshop",
            "category": "photoshop",
            "description": "Photoshop can edit and compose raster images in multiple layers and supports masks, alpha compositing and several color models. Photoshop uses its own PSD and PSB file formats to support these features. In addition to raster graphics, Photoshop has limited abilities to edit or render text and vector graphics (especially through clipping path for the latter), as well as 3D graphics and video. Its feature set can be expanded by plug-ins; programs developed and distributed independently of Photoshop that run inside it and offer new or enhanced features."
          },
          {
            "id": 17,
            "skill": "premiere",
            "category": "premiere",
            "description": "Premiere Pro can be used for all common video editing tasks necessary for producing broadcast-quality, high-definition video. It can be used to import video, audio and graphics, and is used to create new, edited versions of video which can be exported to the medium and format necessary for the distribution. When creating videos using Premiere Pro, various videos, still images and audio files can be edited together. Titles and motion graphics can be added to videos and filters can be applied along with other effects."
          },
          {
            "id": 18,
            "skill": "Lightroom",
            "category": "lightroom",
            "description": " Lightroom's editing functions include white balance, presence, tone, tone curve, HSL, color grading, detail, lens corrections, and calibration manipulation, as well as transformation, spot removal, red eye correction, graduated filters, radial filters, and adjustment brushing. The name of the software is based on darkrooms used for processing light-sensitive photographic materials."
          },
          {
            "id": 19,
            "skill": "After Effects",
            "category": "after_effects",
            "description": "Adobe After Effects is a digital visual effects, motion graphics, and compositing application developed by Adobe Inc.; it is used in the post-production process of film making, video games and television production. Among other things, After Effects can be used for keying, tracking, compositing, and animation. It also functions as a very basic non-linear editor, audio editor, and media transcoder. In 2019, the program won an Academy Award for scientific and technical achievement.[3]"
          },
          {
            "id": 20,
            "skill": "ableton live",
            "category": "ableton",
            "description": "Ableton Live, also known as Live or sometimes colloquially as 'Ableton', is a digital audio workstation for macOS and Windows developed by the German company Ableton. In contrast to many other software sequencers, Live is designed to be an instrument for live performances as well as a tool for composing, recording, arranging, mixing, and mastering. It is also used by DJs, as it offers a suite of controls for beatmatching, crossfading, and other different effects used by turntablists, and was one of the first music applications to automatically beatmatch songs.[3]"
          }
        ]
      }
    },
    "work": {
      "modal": "i want to explore all work",
      "goBack": "go back",
      "category": {
        "frontEnd": "front-end development",
        "videoArt": "video art",
        "miscellaneous": "miscellaneous"
      },
      "categoryItem": [
        {
          "id": 1,
          "name": "★this website★",
          "slug": "my-web",
          "category": "front-end development",
          "description01": "Made with love and possibly constantly changing 🧸🎀",
          "description02": "tech stack: HTML, CSS (SCSS), Javascript, Vue.js, Nuxt.js",
          "description03": "additional info: 2023-present",
          "link": "",
          "linkDescription": "",
          "images": []
        },
        {
          "id": 2,
          "name": "work-related-projects",
          "slug": "work-related-projects",
          "category": "front-end development",
          "description01": "Projects for a variety of clients such as e-commerce clients, social organizations and business companies, where I helped developing them as a trainee/junior front-end developer.",
          "description02": "tech stack: HTML, CSS (SCSS), Javascript, Vue.js, Nuxt.js, Blade Php, Bootstrap, Tailwind CSS, Jquery, Alpine.js, Antlers Templates (Statamic)",
          "description03": "additional info: 2023-2024",
          "link": "https://app.justwork.pt/",
          "linkDescription": "link to website",
          "link02": "https://www.chavenova.com/",
          "linkDescription02": "link to website",
          "link03": "https://thelot.yust.com/",
          "linkDescription03": "link to website",
          "link04": "https://aplaceantwerp.be/",
          "linkDescription04": "link to website",
          "images": []
        },
        {
          "id": 3,
          "name": "kunst 3",
          "slug": "kunst-3",
          "category": "front-end development",
          "description01": "Website of a fictitious cultural space, a project that I developed in my spare time from work. I practiced on 4 important steps of an institutional website: the homepage, the events list page, the page for each event and a modal where the customer can buy a ticket for each respective event. I also used Internationalization (i18n) to make it possible to change languages between english and german.",
          "description02": "tech stack: HTML, CSS (SCSS), Javascript, Vue.js, Nuxt.js, i18n",
          "description03": "additional info: 2023",
          "link": "https://kunst3.netlify.app/",
          "linkDescription": "link to website",
          "images": []
        },
        {
          "id": 4,
          "name": "kapa4",
          "slug": "kapa-4",
          "category": "video art",
          "description01": "Vaguely based on the futurist flyer K4, O Quadrado Azul by Almada Negreiros.",
          "description02": "additional info: 2017, video exhibition, 4’17” @ LOOPCAVE, Desterro",
          "link": "https://vimeo.com/202110873",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/kapa4/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/kapa4/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/kapa4/3.png"
            },
            {
              "id": 4,
              "image": "/images/video_art/kapa4/4.png"
            }
          ]
        },
        {
          "id": 5,
          "name": "시공간 @espaço/tempo",
          "slug": "espaço-tempo",
          "category": "video art",
          "description01": "Surrealist approach of quantum mechanics Time and Space (Spacetime) concept.",
          "description02": "additional info: 2017, video 2’23”",
          "link": "https://vimeo.com/202770388",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/espaço_tempo/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/espaço_tempo/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/espaço_tempo/3.png"
            },
            {
              "id": 4,
              "image": "/images/video_art/espaço_tempo/4.png"
            }
          ]
        },
        {
          "id": 6,
          "name": "Energy Field",
          "slug": "energy-field",
          "category": "video art",
          "description01": "An installation with two televisions and headphones: the TV and ear of the headphone from the left represent the left-brain and the TV and ear of the headphone from the right represent the right-brain, both of them show the same information.",
          "description02": "additional info: 2018, video installation 5’24” @ Faculty of Fine Arts Lisbon",
          "link": "https://vimeo.com/277728983",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/energy_field/1.jpg"
            },
            {
              "id": 2,
              "image": "/images/video_art/energy_field/2.jpg"
            }
          ]
        },
        {
          "id": 7,
          "name": "Life 0",
          "slug": "life-0",
          "category": "video art",
          "description01": "Which came first, the Chicken or the Egg? concept (individual transformation cycle)",
          "description02": "additional info: 2019, video exhibition 5’17” @ Festival SOMA",
          "link": "https://vimeo.com/343492455",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/life0/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/life0/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/life0/3.png"
            },
            {
              "id": 4,
              "image": "/images/video_art/life0/4.png"
            },
            {
              "id": 5,
              "image": "/images/video_art/life0/5.png"
            }
          ]
        },
        {
          "id": 8,
          "name": "Explaining Sound To A Deaf Person",
          "slug": "explaining-sound-to-a-deaf-person",
          "category": "video art",
          "description01": "Visual representation of sound waves and effects (how is sound perceived as a deaf person)",
          "description02": "additional info: 2019, video exhibition 4’27” @ Zaratan, Arte Contemporânea",
          "link": "https://vimeo.com/352076169",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/explaining_sound/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/explaining_sound/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/explaining_sound/3.png"
            }
          ]
        },
        {
          "id": 9,
          "name": "lunch time/pleasure and pain: a constant feeling of nothingness through 4 hours straight",
          "slug": "lunch-time-pleasure-pain",
          "category": "video art",
          "description01": "A political and social critique about long work shifts and its direct link to singular loneliness and alienation, filmed during my 4 hour work break.",
          "description02": "additional info: 2021, video installation 45’14” @ Festival A Colina",
          "link": "https://vimeo.com/655658351",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/pleasure_pain/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/pleasure_pain/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/pleasure_pain/3.png"
            }
          ]
        },
        {
          "id": 10,
          "name": "power house nr8",
          "slug": "power-house-8",
          "category": "video art",
          "description01": "The importance of the number 8 when I was born, being also the magazine's number edition.",
          "description02": "additional info: 2022, video 2’56” @ Dose magazine",
          "link": "https://vimeo.com/722374867",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/power_house_8/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/power_house_8/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/power_house_8/3.png"
            },
            {
              "id": 4,
              "image": "/images/video_art/power_house_8/4.png"
            }
          ]
        },
        {
          "id": 11,
          "name": "Negative Index",
          "slug": "negative-index",
          "category": "video art",
          "description01": "Long rant about a failed love story in a foreign country, filmed during my stay there.",
          "description02": "additional info: 2023, video 6’59”",
          "link": "https://vimeo.com/802064965",
          "linkDescription": "link to video",
          "images": [
            {
              "id": 1,
              "image": "/images/video_art/negative_index/1.png"
            },
            {
              "id": 2,
              "image": "/images/video_art/negative_index/2.png"
            },
            {
              "id": 3,
              "image": "/images/video_art/negative_index/3.png"
            },
            {
              "id": 4,
              "image": "/images/video_art/negative_index/4.png"
            },
            {
              "id": 5,
              "image": "/images/video_art/negative_index/5.png"
            }
          ]
        },
        {
          "id": 12,
          "name": "Dose 8",
          "slug": "dose-8",
          "category": "miscellaneous",
          "description01": "6 photoshop collages, here showing the magazine selected color and the original color, about the same theme of the video (it can be watched in the video art section)",
          "description02": "additional info: 2022, collages @ Dose magazine",
          "link": "https://www.instagram.com/dose_mag/",
          "linkDescription": "link to instagram",
          "images": [
            {
              "id": 1,
              "image": "/images/miscellaneous/dose8/dose1_1.jpg"
            },
            {
              "id": 2,
              "image": "/images/miscellaneous/dose8/dose1.jpg"
            },
            {
              "id": 3,
              "image": "/images/miscellaneous/dose8/dose2_1.jpg"
            },
            {
              "id": 4,
              "image": "/images/miscellaneous/dose8/dose2.jpg"
            },
            {
              "id": 5,
              "image": "/images/miscellaneous/dose8/dose3_1.jpg"
            },
            {
              "id": 6,
              "image": "/images/miscellaneous/dose8/dose3.jpg"
            },
            {
              "id": 7,
              "image": "/images/miscellaneous/dose8/dose4_1.jpg"
            },
            {
              "id": 8,
              "image": "/images/miscellaneous/dose8/dose4.jpg"
            },
            {
              "id": 9,
              "image": "/images/miscellaneous/dose8/dose5_1.jpg"
            },
            {
              "id": 10,
              "image": "/images/miscellaneous/dose8/dose5.jpg"
            },
            {
              "id": 11,
              "image": "/images/miscellaneous/dose8/dose6_1.jpg"
            },
            {
              "id": 12,
              "image": "/images/miscellaneous/dose8/dose6.jpg"
            }
          ]
        },
        {
          "id": 13,
          "name": "IMAGO: Intra-connective",
          "slug": "dose-8",
          "category": "miscellaneous",
          "description01": "Conceptual collective exhibition that actually existed, in times of social isolation, where we existed at covid-19. Gonsalo recreated, through 3d modeling, the ideal works of 7 artists, including himself. This fictional exhibition appeared to be as real as ever, as 2020 expressed the need to globally connect through technology and deceive.",
          "description02": "additional info: 2020, 3d object installation @ IMAGO, Curated by Isabel Ouro",
          "link": "https://gonssalo.com/imago-eng",
          "linkDescription": "link to website",
          "images": [
            {
              "id": 1,
              "image": "/images/miscellaneous/imago/imago_1.png"
            },
            {
              "id": 2,
              "image": "/images/miscellaneous/imago/imago_2.png"
            },
            {
              "id": 3,
              "image": "/images/miscellaneous/imago/imago_3.png"
            }
          ]
        },
        {
          "id": 14,
          "name": "rádio Teia",
          "slug": "radio-teia",
          "category": "miscellaneous",
          "description01": "3 tracks mix for Teia 25",
          "description02": "additional info: 2021, selected mix @ rádio Teia",
          "link": "https://teiaradio.com/",
          "linkDescription": "link to website",
          "images": []
        },
        {
          "id": 15,
          "name": "Out the Window: 2 Be",
          "slug": "2-be",
          "category": "miscellaneous",
          "description01": "Installation of a disney TV, a warrior and the fake reflection of it in a video on loop playing on the TV. The video is pre-done and it's not representative of the warrior in the present moment, but it appears to be recording the warrior live.",
          "description02": "additional info: 2020, object/video installation 29’00” @ galeria Arte Graça",
          "link": "https://artegraca.pt/out-the-window/",
          "linkDescription": "link to website",
          "images": [
            {
              "id": 1,
              "image": "/images/miscellaneous/2be/2be_1.jpg"
            },
            {
              "id": 2,
              "image": "/images/miscellaneous/2be/2be_2.jpg"
            }
          ]
        }
      ]
    },
    "contact": {
      "text": "send me an email",
      "email": "joanaluzp@gmail.com",
      "cv": {
        "description": "CV Joana Pimentel",
        "link": "/files/CV.pdf",
        "linkText": "cv"
      },
      "github": {
        "description": "GitHub Joana Pimentel",
        "link": "https://github.com/joanaluzp",
        "linkText": "github"
      }
    },
    "footer": {
      "text": "design and development by Joana da Luz Pimentel"
    }
  }
}
